#include "../include/graph_data.h"

#include <cstddef> 

const char* track_b[] = {
    "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁5 ▁▁▁▁▁▁▁▁▁▁▁▁▁ 18▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁ 3▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁",
    "                         ╱                ╲                      ╲                       ",
    "      ▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁7 ▁▁▁▁▁▁o▁▁▁o▁▁▁▁▁▁ 6▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁     2▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁",
    "     ╱                                                        ╲    ╲                     ",
    "    o ▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁17 ▁▁o▁▁▁o▁▁ 16▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁ ╲     1▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁",
    "   ╱ ╱                      ╲         ╱                       ╲ ╲    ╲                  ",
    "  ╱ o                        o       o                         ╲ ╲    ╲                 ",
    " ╱ ╱                          ╲  │  ╱                           ╲ │    |                ",
    "│ ╱                            o │ o                              15   │                ",
    "8                               ╲│╱                               │    o                ",
    "│                            154   153                            o    │                ",
    "│                                │                                │    │                ",
    "│                            155   156                            │    │                ",
    "│                               ╱│╲                               o    │                ",
    "9                              o │ o                              │    o                ",
    "│ ╲                           ╱  |  ╲                             14   │                ",
    " ╲ ╲                         o       o                          ╱ │    │                ",
    "  ╲ o                       ╱         ╲                        ╱ ╱    ╱                 ",
    "   ╲ ╲▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁10 ▁▁o▁▁▁o▁▁ 13▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁╱ ╱     4▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁",
    "    o                                                          ╱    ╱                    ",
    "     ╲▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁ 11▁▁ 12▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁"
};

// Positions for switches in Track B (switch ID, row number, column number)
const SwitchPos track_b_switches[] = {
    {5, 0, 27}, {18, 0, 41}, {3, 0, 65}, {7, 2, 25},
    {6, 2, 43}, {2, 2, 67}, {17, 4, 29}, {16, 4, 39},
    {1, 4, 69}, {15, 8, 66}, {8, 9, 2}, {154, 10, 33},
    {153, 10, 35}, {155, 12, 33}, {156, 12, 35},  {9, 14, 2},
    {14, 15, 66}, {10, 18, 29}, {13, 18, 39}, {4, 18, 70}, 
    {11, 20, 63}, {12, 20, 68}, 
};

const std::size_t track_b_count = sizeof(track_b)/sizeof(char*);

const std::size_t track_b_switches_count = sizeof(track_b_switches) / sizeof(SwitchPos);

const TrackConfig TRACK_B = {
    .diagram = track_b,
    .diagram_lines = track_b_count,
    .switches = track_b_switches,
    .switches_count = track_b_switches_count
};

const char* track_a[] = {
    "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁12C▁11C▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁",
    "                     ╱  ╱                                                     ╲",
    "▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁4C▁▁╱  ╱ ▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁13C▁▁o▁▁▁▁▁o▁▁C10▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁ o",
    "                ╱     ╱ ╱                     ╲         ╱                     ╲ ╲",
    "▁▁▁▁▁▁▁▁▁▁o▁▁▁▁╱     ╱ ╱                       o       o                       o ╲ ",
    "                    │ ╱                         ╲  │  ╱                         ╲ ╲",
    "                   14                            o │ o                           ╲ │",
    "                    │                             ╲│╱                              9",
    "                    o                          156C S155                           │",
    "                    │                              │                               │",
    "                    │                          153C C154                           │",
    "                    o                             ╱│╲                              │",
    "                    │                            o │ o                             8",
    "                   15                           ╱  │  ╲                          ╱ │",
    "▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁  │ ╲                        o       o                        o ╱ ",
    "                  ╲  ╲ ╲                      ╱         ╲                      ╱ ╱ ",
    "▁o▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁1C  ╲ ╲▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁16C▁o▁▁▁▁▁▁▁o▁C17▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁╱ o",
    "                    ╲  ╲                                                       ╱",
    "▁o▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁2C  ╲▁▁▁▁▁▁▁▁o▁▁▁▁▁▁6C▁▁▁▁o▁▁▁▁▁▁▁▁▁o▁▁▁▁C7▁▁▁▁▁o▁▁▁▁▁▁▁▁▁╱   ",
    "                      ╲                  ╲                   ╱   ",
    "▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁3C▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁18C▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁C5▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁"
};

// Positions for switches in Track A (switch ID, row number, column number)
const SwitchPos track_a_switches[] = {
    {12, 0, 23}, {11, 0, 27}, {4, 2, 18}, {13, 2, 46},
    {10, 2, 58}, {14, 6, 22}, {9, 7, 83}, {156, 8, 51}, 
    {155, 8, 53}, {153, 10, 51}, {154, 10, 53}, {8, 12, 83},
    {15, 13, 22}, {1, 16, 20}, {16, 16, 46}, {17, 16, 58},
    {2, 18, 22}, {6, 18, 42}, {7, 18, 62}, {3, 20, 24},
    {18, 20, 44}, {5, 20, 61}
};

const std::size_t track_a_count = sizeof(track_a)/sizeof(char*);

const std::size_t track_a_switches_count = sizeof(track_a_switches) / sizeof(SwitchPos);

const TrackConfig TRACK_A = {
    .diagram = track_a,
    .diagram_lines = track_a_count,
    .switches = track_a_switches,
    .switches_count = track_a_switches_count
};