#include "../include/graph_data.h"

#include <cstddef> 

const char* track_b[] = {
    "▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁5 ▁▁▁▁▁▁▁▁▁▁▁▁▁ 18▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁ 3▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁",
    "                         ╱                ╲                      ╲                       ",
    "      ▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁7 ▁▁▁▁▁▁o▁▁▁o▁▁▁▁▁▁ 6▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁     2▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁",
    "     ╱                                                        ╲    ╲                     ",
    "    o ▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁17 ▁▁o▁▁▁o▁▁ 16▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁ ╲     1▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁",
    "   ╱ ╱                      ╲         ╱                       ╲ ╲    ╲                  ",
    "  ╱ o                        o       o                         ╲ ╲    ╲                 ",
    " ╱ ╱                          ╲  │  ╱                           ╲ │    |                ",
    "│ ╱                            o │ o                              15   │                ",
    "8                               ╲│╱                               │    o                ",
    "│                            154   153                            o    │                ",
    "│                                │                                │    │                ",
    "│                            155   156                            │    │                ",
    "│                               ╱│╲                               o    │                ",
    "9                              o │ o                              │    o                ",
    "│ ╲                           ╱  |  ╲                             14   │                ",
    " ╲ ╲                         o       o                          ╱ │    │                ",
    "  ╲ o                       ╱         ╲                        ╱ ╱    ╱                 ",
    "   ╲ ╲▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁10 ▁▁o▁▁▁o▁▁ 13▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁╱ ╱     4▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁",
    "    o                                                          ╱    ╱                    ",
    "     ╲▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁ 11▁▁ 12▁▁▁▁o▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁"
};

// Positions for switches in Track B (switch ID, row number, column number)
const SwitchPos track_b_switches[] = {
    {5, 0, 27}, {18, 0, 41}, {3, 0, 65}, {7, 2, 25},
    {6, 2, 43}, {2, 2, 67}, {17, 4, 29}, {16, 4, 39},
    {1, 4, 69}, {15, 8, 66}, {8, 9, 2}, {154, 10, 33},
    {153, 10, 35}, {155, 12, 33}, {156, 12, 35},  {9, 14, 2},
    {14, 15, 66}, {10, 18, 29}, {13, 18, 39}, {4, 18, 70}, 
    {11, 20, 63}, {12, 20, 68}, 
};

const std::size_t track_b_count = sizeof(track_b)/sizeof(char*);

const std::size_t track_b_switches_count = sizeof(track_b_switches) / sizeof(SwitchPos);

const TrackConfig TRACK_B = {
    .diagram = track_b,
    .diagram_lines = track_b_count,
    .switches = track_b_switches,
    .switches_count = track_b_switches_count
};